### Import Numpy and Pandas Libraries

In [1]:
import numpy as np
import pandas as pd
import os

# Q1. Read the '.csv' file into a data frame and display the first 5 rows.

In [2]:
df=pd.read_csv('Forbes_Billionaire.csv')
df

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology
...,...,...,...,...,...,...,...
2090,1990,DAVID HALL,68.0,1.0,United States,automotive technology,Automotive
2091,1990,DU SHA,73.0,1.0,China,hypermarkets,Diversified
2092,1990,WANG YANQING,73.0,1.0,China,carbon fiber products,Manufacturing
2093,1990,XU WANMAO,75.0,1.0,China,education,Service
2094,1990,WANG MIAOTONG,62.0,1.0,China,auto parts,Automotive

In [3]:
df.head()

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology

# Q2. Name the top 8 industries with maximum count of billionaires

In [4]:
top8 = list(df['Industries'].value_counts().head(8).index)
top8

['Finance & Investments',
 'Technology',
 'Fashion & Retail',
 'Manufacturing',
 'Real Estate',
 'Diversified',
 'Food & Beverage',
 'Healthcare']

# Q3. State the headcount of billionaires from these top 8 industries

In [5]:
df[df['Industries'].isin(top8)].groupby('Industries')['Net Worth'].mean().sort_values()

Industries
Manufacturing            2.730303
Healthcare               2.857047
Real Estate              3.277551
Diversified              3.293491
Finance & Investments    3.430201
Food & Beverage          3.708333
Fashion & Retail         5.372727
Technology               5.634440
Name: Net Worth, dtype: float64

# Q4. Compare the mean of net worth of billionaires from these top 8 industries.

In [6]:
df[df['Industries'].isin(top8)].groupby('Industries')['Net Worth'].mean().sort_values()

Industries
Manufacturing            2.730303
Healthcare               2.857047
Real Estate              3.277551
Diversified              3.293491
Finance & Investments    3.430201
Food & Beverage          3.708333
Fashion & Retail         5.372727
Technology               5.634440
Name: Net Worth, dtype: float64

# Q5. Compare the mean age of billionaires from these top 8 industries.

In [7]:

filtered_df = df[df['Industries'].isin(top8)]


mean_age_by_industry = filtered_df.groupby('Industries')['Age'].mean().sort_values()

mean_age_by_industry

Industries
Technology               55.375527
Healthcare               63.088435
Manufacturing            64.139896
Food & Beverage          64.862500
Finance & Investments    65.810811
Real Estate              65.895288
Diversified              66.889571
Fashion & Retail         66.893204
Name: Age, dtype: float64

# Q6. Name the Richest billionaire in the Automotive sector

In [18]:
df.query('Industries == "Automotive"').sort_values('Net Worth',ascending=False).head(1)['Name']

30    ELON MUSK
Name: Name, dtype: object

# Q7. Name top 5 countries with maximum number of billionaires.

In [12]:
top5 = list(df['Country'].value_counts().head(5).index)
top5

['United States', 'China', 'Germany', 'India', 'Russia']

# Q8. Which amongst these top 5 countries have the lowest mean age of billionaires ?

In [14]:
df[df['Country'].isin(top5)].groupby('Country')['Age'].mean().sort_values()

Country
China            56.790026
Russia           56.848485
Germany          64.147368
India            66.206186
United States    66.911620
Name: Age, dtype: float64

# Q9. Name the richest Chinese billionaire and his net worth

In [16]:
df.query('Country =="China"').head(1)[['Name','Net Worth']]

       Name  Net Worth
16  JACK MA       38.8

# Q10. Name top 5 Industries with maximum number of Indian billionaires.

In [20]:
top5_India = list(df.query('Country == "India"')['Industries'].value_counts().head().index)
top5_India

['Healthcare', 'Manufacturing', 'Diversified', 'Technology', 'Food & Beverage']

# Q11. Name all the Indian billionaires in global top 100 list.

In [21]:
df.query('Country == "India" and Rank<101')

,Rank,Name,Age,Net Worth,Country,Source,Industries
20,21,MUKESH AMBANI,62.0,36.8,India,"petrochemicals, oil & gas",Energy
77,78,RADHAKISHAN DAMANI & FAMILY,65.0,13.8,India,"retail, investments",Fashion & Retail

# Q12. Name all the billionaires in India who are younger than 50 years. Also state their mean net worth

In [22]:
df.query('Country == "India" and Age<50')

,Rank,Name,Age,Net Worth,Country,Source,Industries
874,875,VIJAY SHEKHAR SHARMA,41.0,2.4,India,financial technology,Service
1196,1196,BYJU RAVEENDRAN,38.0,1.8,India,education technology,Technology
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1420,1415,RANJAN PAI,47.0,1.5,India,education,Service
1618,1613,SHAMSHEER VAYALIL,43.0,1.3,India,healthcare,Healthcare
1732,1730,SACHIN BANSAL,38.0,1.2,India,flipkart,Fashion & Retail
1742,1730,RADHA VEMBU,47.0,1.2,India,technology,Technology
1856,1851,BINNY BANSAL,37.0,1.1,India,flipkart,Technology
1867,1851,ACHARYA BALKRISHNA,47.0,1.1,India,consumer goods,Food & Beverage

In [24]:
df.query('Country == "India" and Age<50')['Net Worth'].mean()

1.488888888888889

# Q13. Name the Indian billionaires from real estate sector who are richer than 'DONALD TRUMP'.

In [36]:
india_real_estate=df.query('Country == "India" and Industries =="Real Estate"')
india_real_estate

,Rank,Name,Age,Net Worth,Country,Source,Industries
494,494,KUSHAL PAL SINGH,88.0,3.7,India,real estate,Real Estate
774,764,CHANDRU RAHEJA,79.0,2.7,India,real estate,Real Estate
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1253,1196,MANGAL PRABHAT LODHA,64.0,1.8,India,real estate,Real Estate
1395,1335,JITENDRA VIRWANI,54.0,1.6,India,real estate,Real Estate
1712,1613,NIRANJAN HIRANANDANI,70.0,1.3,India,real estate,Real Estate
1716,1613,SUBHASH RUNWAL,76.0,1.3,India,real estate,Real Estate
1983,1851,MOFATRAJ MUNOT,75.0,1.1,India,real estate,Real Estate

In [39]:
networth_donaltrump=df.query('Name == "DONALD TRUMP"')['Net Worth'].values[0]
networth_donaltrump

2.1

In [34]:
df.query('Name == "DONALD TRUMP"')['Net Worth'].sum()

2.1

# Q14. What is the total cumulative net worth of all the billionaires?

In [40]:
df['Net Worth'].sum()

8037.499999999999

In [41]:
df['Net Worth'].cumsum()  # to calculate running totals

0        113.0
1        211.0
2        287.0
3        354.5
4        413.5
         ...
2090    8033.5
2091    8034.5
2092    8035.5
2093    8036.5
2094    8037.5
Name: Net Worth, Length: 2095, dtype: float64

# END